In [126]:
import pandas as pd
import numpy as np

In [127]:
# Example main DataFrame
main_df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                        'B': [5, 0, 7, 8, 0],
                        'C': [0, 9, 0, 2, 0]})

main_df

   A  B  C
0  0  5  0
1  1  0  9
2  2  7  0
3  3  8  2
4  4  0  0

In [128]:
# Define the replacement values in a dictionary
replacements = {
    'B': {0: np.nan},
    'C': {i: np.nan for i in main_df['C'] if i < 5},
}

# Apply the replacements to the DataFrame
main_df = main_df.replace(replacements)

In [129]:
main_df

   A    B    C
0  0  5.0  NaN
1  1  NaN  9.0
2  2  7.0  NaN
3  3  8.0  NaN
4  4  NaN  NaN

In [130]:
dic = {'sect': 'act / All / aaa'}

In [131]:
dic['sect2'] = 'act2 / Spec / main_df.A.mask(main_df.B.isna(), np.nan)'

In [132]:
type(dic)

dict

In [133]:
dic

{'sect': 'act / All / aaa',
 'sect2': 'act2 / Spec / main_df.A.mask(main_df.B.isna(), np.nan)'}

In [134]:
df = pd.DataFrame(dic, index = ['a'])

In [135]:
df

              sect                                              sect2
a  act / All / aaa  act2 / Spec / main_df.A.mask(main_df.B.isna(),...

In [136]:
p_process = {'pre_processing' : dic}

In [137]:
p_process

{'pre_processing': {'sect': 'act / All / aaa',
  'sect2': 'act2 / Spec / main_df.A.mask(main_df.B.isna(), np.nan)'}}

In [138]:
df2 = pd.DataFrame(p_process).reset_index()

In [139]:
df2

   index                                     pre_processing
0   sect                                    act / All / aaa
1  sect2  act2 / Spec / main_df.A.mask(main_df.B.isna(),...

In [140]:
df2[['Column2_1', 'Column2_2', 'Column2_3']] = df2['pre_processing'].str.split(' / ', expand=True)

In [141]:
df2

,index,pre_processing,Column2_1,Column2_2,Column2_3
0,sect,act / All / aaa,act,All,aaa
1,sect2,"act2 / Spec / main_df.A.mask(main_df.B.isna(),...",act2,Spec,"main_df.A.mask(main_df.B.isna(), np.nan)"

In [142]:
df2.iloc[-1:,-1:].values[0].item()

'main_df.A.mask(main_df.B.isna(), np.nan)'

In [147]:
df2.iloc[-1:,-1:].values.item()

'main_df.A.mask(main_df.B.isna(), np.nan)'

In [143]:
main_df['D'] = eval(df2.iloc[-1:,-1:].values[0].item())

In [144]:
main_df

   A    B    C    D
0  0  5.0  NaN  0.0
1  1  NaN  9.0  NaN
2  2  7.0  NaN  2.0
3  3  8.0  NaN  3.0
4  4  NaN  NaN  NaN

In [148]:
main_df = main_df.drop('C', axis = 1)
main_df

   A    B    D
0  0  5.0  0.0
1  1  NaN  NaN
2  2  7.0  2.0
3  3  8.0  3.0
4  4  NaN  NaN

In [150]:
try:
    main_df = main_df.drop('E', axis = 1)
except:
    pass
main_df

   A    B    D
0  0  5.0  0.0
1  1  NaN  NaN
2  2  7.0  2.0
3  3  8.0  3.0
4  4  NaN  NaN

In [151]:
filt = pd.DataFrame({'Meaning': ['unknown', 'unknown'],
                        'Score': [5, 3],
                        })

In [152]:
filt

   Meaning  Score
0  unknown      5
1  unknown      3

In [157]:
# Create the first data frame
df1 = pd.DataFrame({'col': ['A', 'B'], 'score': [0, 1]})
df1

  col  score
0   A      0
1   B      1

In [158]:
# Create the second data frame
df2 = pd.DataFrame({'A': [5, 3, 2, 0, 1],
                    'B': [0, 2, 1, 3, 4],
                    'C': [1, 2, 3, 4, 5]})
df2

   A  B  C
0  5  0  1
1  3  2  2
2  2  1  3
3  0  3  4
4  1  4  5

In [159]:
# Find the matching columns
matching_cols = df1['col'].tolist()

In [160]:
# Replace matching values with np.nan
df2.loc[:, matching_cols] = df2.loc[:, matching_cols].replace(df1['score'].values, np.nan)
df2

     A    B  C
0  5.0  NaN  1
1  3.0  2.0  2
2  2.0  NaN  3
3  NaN  3.0  4
4  NaN  4.0  5

In [161]:
# Create the first data frame
df1 = pd.DataFrame({'col': ['A', 'B'], 'score': [0, 1]})

# Create the second data frame
df2 = pd.DataFrame({'A': [5, 3, 2, 0, 1],
                    'B': [0, 0, 1, 1, 0],
                    'C': [1, 2, 3, 4, 5]})

# Find the matching values in 'A' column and replace them with np.nan
df2['A'] = np.where((df2['A'] == df1.loc[df1['col'] == 'A', 'score'].values[0]), np.nan, df2['A'])

# Find the matching values in 'B' column and replace them with np.nan
df2['B'] = np.where((df2['B'] == df1.loc[df1['col'] == 'B', 'score'].values[0]), np.nan, df2['B'])

print(df2)

     A    B  C
0  5.0  0.0  1
1  3.0  0.0  2
2  2.0  NaN  3
3  NaN  NaN  4
4  1.0  0.0  5

In [162]:
import pandas as pd
import numpy as np

# Reference DataFrame
df_ref = pd.DataFrame({'col': ['A', 'B'], 'score': [0, 1]})

# DataFrame to be updated
df = pd.DataFrame({'A': [5, 3, 2, 0, 1],
                   'B': [0, 0, 1, 1, 0],
                   'C': [1, 2, 3, 4, 5]})

# Set the 'col' column as the index in the reference DataFrame
df_ref.set_index('col', inplace=True)

# Get the matching values mask
mask = df.eq(df_ref['score'], axis=1)

# Replace the matching values with np.nan
df = df.mask(mask)

print(df)

     A    B  C
0  5.0  0.0  1
1  3.0  0.0  2
2  2.0  NaN  3
3  NaN  NaN  4
4  1.0  0.0  5

In [170]:
# Reference DataFrame
df_ref = pd.DataFrame({'col': ['C', 'B'], 'score': [5, 0]})
df_ref

  col  score
0   C      5
1   B      0

In [171]:
# DataFrame to be updated
df = pd.DataFrame({'A': [5, 3, 2, 0, 1],
                   'B': [0, 0, 1, 1, 0],
                   'C': [1, 2, 3, 4, 5]})
df

   A  B  C
0  5  0  1
1  3  0  2
2  2  1  3
3  0  1  4
4  1  0  5

In [172]:
# Set the 'col' column as the index in the reference DataFrame
df_ref.set_index('col', inplace=True)
df_ref

     score
col
C        5
B        0

In [173]:
# Get the matching values mask
mask = df.eq(df_ref['score'], axis=1)
mask

       A      B      C
0  False   True  False
1  False   True  False
2  False  False  False
3  False  False  False
4  False   True   True

In [174]:
df = df.mask(mask)

In [175]:
df

   A    B    C
0  5  NaN  1.0
1  3  NaN  2.0
2  2  1.0  3.0
3  0  1.0  4.0
4  1  NaN  NaN

In [19]:
for i, j in enumerate(['aaa', 'bbb', 'ccc']):
    globals()['v_' + j] = i * 100

In [20]:
v_ccc

200

In [3]:
'aaa'

'aaa'

In [9]:
variable_names = ['aaa', 'bbb', 'ccc']
values = [10, 20, 30]

for i, j in enumerate(values):
    globals()[variable_names[i]] = j

In [10]:
aaa

10

In [2]:
import pandas as pd

# Assuming you have a DataFrame with the column named 'column_name'
df = pd.DataFrame({'column_name': ['KBA13_HHZ', 'CJT_TYP_6', 'ARBEIT', 'D19_LOTTO', 'D19_VERSI_DATUM', 'RT_UEBERGROESSE', 'STRUKTURTYP']})

# Extract strings before underscore and assign 'excl' if underscore does not exist
df['new_column'] = df['column_name'].apply(lambda x: x.split('_')[0] if '_' in x else 'excl')

print(df)

       column_name new_column
0        KBA13_HHZ      KBA13
1        CJT_TYP_6        CJT
2           ARBEIT       excl
3        D19_LOTTO        D19
4  D19_VERSI_DATUM        D19
5  RT_UEBERGROESSE         RT
6      STRUKTURTYP       excl